app/views/users/show.html.erb

SELECT  1 AS one FROM "daily_workouts"  WHERE "daily_workouts"."user_id" = $1 LIMIT 1  [["user_id", 1]]
---

<% if @user.daily_workouts.any? %>