app/views/challenges/index.html.erb

SELECT "challenges".* FROM "challenges"  WHERE "challenges"."user_id" = $1  [["user_id", 1]]
---
<%= link_to 'New Challenge', new_user_challenge_path %>
<% @user.challenges.each do |challenge| %>