app/controllers/challenges_controller.rb

  def index
    @user = User.find(session[:user_id])
    @challenge = Challenge.where(user_id: session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "challenges".* FROM "challenges"  WHERE "challenges"."user_id" = $1  [["user_id", 1]]

  def show
    @user = User.find(session[:user_id])
    @challenge = Challenge.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "challenges".* FROM "challenges"  WHERE "challenges"."id" = $1 LIMIT 1  [["id", 1]]