app/controllers/sessions_controller.rb

SELECT  "authorizations".* FROM "authorizations"  WHERE "authorizations"."uid" = '2S4QZP' LIMIT 1
INSERT INTO "users" ("created_at", "fullname", "oauth_secret", "oauth_token", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "authorizations" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-06-27 15:14:32.947800"], ["provider", "fitbit"], ["uid", "2S4QZP"], ["updated_at", "2014-06-27 15:14:32.947800"], ["user_id", 1]]
---
  def create
    auth_hash = request.env['omniauth.auth']
    authorization = Authorization.find_by(uid: auth_hash['uid'])

    if authorization.nil?
      user = User.create!(fullname: auth_hash[:info].full_name, oauth_token: auth_hash.credentials.token, oauth_secret: auth_hash.credentials.secret)
      authorization = Authorization.create!(user: user, provider: auth_hash[:provider], uid: auth_hash[:uid])